{"value": [{"name": "‘Bridge to Everywhere’ seen as a boon to downtown <b>Long Beach</b> and beyond", "url": "https://www.presstelegram.com/2020/09/17/bridge-to-everywhere-seen-as-a-boon-to-downtown-long-beach-and-beyond/", "datePublished": "2020-09-17T22:55:00.0000000Z", "organization": "Press-Telegram", "summary": "The Gerald Desmond Bridge Replacement Project is getting closer to its grand opening in Long Beach on Wednesday, September 16, 2020.\n(Photo by Brittany Murray, Press-Telegram/SCNG)The Gerald Desmond Bridge Replacement Project is getting closer to its grand opening in Long Beach on Wednesday, September 16, 2020.\n“It’s a great, iconic bridge,” said Mario Cordero, executive director of the Port of Long Beach, “the ‘Bridge to Everywhere.’”There’s not a congressional district in the country, he added, that doesn’t receive merchandise from containers that are processed through the Ports of Los Angeles and Long Beach.\nIt also will be a boon to downtown Long Beach, speakers at Wednesday’s event said.\nIt will make Long Beach, LaBar said, “the port of choice.”“It is really a gateway to our downtown,” said Kraig Kojian, president and CEO of the Downtown Long Beach Alliance."}, {"name": "<b>Long Beach</b> Architecture Week Opens", "url": "https://www.nbclosangeles.com/the-scene/long-beach-architecture-week-opens/2430017/", "datePublished": "2020-09-18T00:41:00.0000000Z", "organization": "NBC Los Angeles", "summary": "Getting to snoop around, by invitation, only ever happens when a house tour or architecture event pops up, but getting to explore while you're in your pajamas?\nThat feels like quite the rare event, and yet it is happening, from Sept. 17 through the 27th, when Long Beach Architecture Week returns as a semi-virtual event.\nPrepare for \"10 Days of Architecture, Design & Discovery\" as you engage in \"... a series of tours, events and educational opportunities that celebrate architecture, promote preservation, sustainability, and new ideas.\"\nIt's a party with plentiful prisms, in short, appealing to architecture buffs who have their favorite areas.\nAn intriguing look around a \"bungalow mansion\" built by Miner Smith, as well as a stop by the oh-so-mod Atkinson Brick House."}, {"name": "<b>Long Beach</b> Island bather pulled from water after being swept into possible rip current", "url": "https://www.app.com/story/news/local/southern-ocean-county/long-beach-township/2020/09/17/long-beach-island-bather-pulled-water-after-swept-into-possible-rip-current/3489086001/", "datePublished": "2020-09-18T02:31:00.0000000Z", "category": "US", "organization": "app.com", "summary": "LONG BEACH TOWNSHIP - A woman was pulled from the water late Thursday afternoon after she and another bather were apparently caught in a rip current, according to authorities.\nThe condition of the woman was not immediately known, although first responders had performed CPR on the victim in the area of 100 Street beach, authorities said.\nDetails about the incident were not immediately available Thursday nightThis is a breaking news story.\nStay with app.com for updates."}, {"name": "Chloe, the severely abused dog found in <b>Long Beach</b> dumpster in 2018, needs your help", "url": "https://abc7.com/community-events/chloe-the-abused-dog-found-in-long-beach-dumpster-needs-your-help/6431459/", "datePublished": "2020-09-17T22:52:00.0000000Z", "video": {"name": "Chloe, the abused dog found in Long Beach dumpster, needs your help", "motionThumbnailUrl": "https://wus-streaming-video-msn-com.akamaized.net/763310e9-6d08-4c2d-8c3a-c24f5bddfe62/dea8ee16-5024-464c-9560-dc33ceb5_650.mp4", "thumbnail": {"width": 640, "height": 360}}, "organization": "ABC7", "summary": "LONG BEACH, Calif. (KABC) -- It's been nearly two years since then 8-month-old puppy, Chloe, was rescued after being found severely abused and abandoned in a dumpster in Long Beach.\nThis poor little girl's been through so much,\" said Doug and Maryanne James, who adopted Chloe in 2019.ABC7 followed Chloe's journey from rescue to adoption.\nThe Long Beach couple still remember the day they laid eyes on the Maltese mix at a meet-and-greet at Pet Food Express.\n\"We were just amazed,\" said Doug James.\n\"We saw the amount of the bills and it was $2,600,\" Maryanne James said."}, {"name": "<b>Long Beach</b> reports 2 more coronavirus deaths, 40 new cases", "url": "https://www.presstelegram.com/2020/09/16/long-beach-reports-2-more-coronavirus-deaths-40-new-cases/", "datePublished": "2020-09-16T23:45:00.0000000Z", "category": "Health", "organization": "Press-Telegram", "summary": "Another two Long Beach residents have died from coronavirus-related causes, officials announced Wednesday, Sept. 16.\nThere have been 11,311 cases reported in Long Beach since the pandemic began.\nThere were 39 Long Beach residents in hospitals with the virus on Wednesday.\nWhile it’s unclear if the state would allow the city to open up more without LA County, Colopy said tracking Long Beach’s progress.\n“There is no question that Long Beach is heading in the right direction,” Garcia said."}, {"name": "<b>Long Beach</b> Poly is No. 1 and Loyola No. 2 in SoCal players on NFL rosters", "url": "https://www.msn.com/en-us/sports/nfl/long-beach-poly-is-no-1-and-loyola-no-2-in-socal-players-on-nfl-rosters/ar-BB198PMs", "mentions": [{"name": "Southern California"}, {"name": "Loyola University Chicago"}, {"name": "Rancho Cuyama"}], "datePublished": "2020-09-17T13:12:00.0000000Z", "category": "Sports", "organization": "The LA Times on MSN.com", "summary": "(David Kawashima / For The Times)Take a bow, alumni of Long Beach Poly.\nYour high school has six active players on NFL rosters, making the Jackrabbits No.\nSTORY: 13 Long Beach products make opening weekend NFL rosters.\nLong Beach Poly with a state-best seven NFL alums (more than twice as many as No.\nLoyola's four players on NFL rosters include David Long (Rams), Myles Bryant (Patriots), Anthony Barr (Vikings) and Coleman Shelton (Rams)."}, {"name": "<b>Long Beach</b>, NY Coronavirus Updates &amp; News For September 17", "url": "https://patch.com/new-york/longbeach/covid-19/2020-09-17", "datePublished": "2020-09-17T19:05:00.0000000Z", "organization": "Patch", "summary": "Adelphi University is laying off 62 full- and part-time staff to help close a budget gap caused by the coronavirus.\n(Courtesy Adelphi University) GARDEN CITY, NY — Adelphi University announced today that it would be laying off dozens of workers due to financial problems caused by the coronavirus.\nIn June, it laid off dozens of workers from its two Long Island stores, located in Westbury and Valley Stream.\nNASSAU COUNTY, NY — Long Island is finally reopened, and things seem to be returning to normal.\nFARMINGDALE, NY — Lifelong artist Lorraine Dicarlo achieved a dream of hers when she officially opened her first business earlier in the week."}, {"name": "<b>Long Beach</b> Hospital Begins Clinical Trials on COVID Treatments", "url": "https://patch.com/california/longbeach-ca/long-beach-hospital-begins-clinical-trials-covid-treatments", "datePublished": "2020-09-16T04:27:00.0000000Z", "category": "Health", "organization": "Patch", "summary": "LONG BEACH, Calif. – MemorialCare Long Beach Medical Center has announced its participation in two multi-national clinical trials testing the effectiveness and safety of two different anti-viral treatments designed to reduce the severity and potentially stop the spread of COVID-19 in both hospitalized and ambulatory patients.\nDr. Johannes and his team are excited to be able to offer these clinical trials to Long Beach and the nearby Los Angeles and Orange County communities.\nLong Beach Medical Center recently participated in the expanded access studies of the drug Remdesivir and convalescent plasma.\nWe hope that a vaccine will be available by the first half of 2021, but evaluating vaccine safety and efficacy requires time and large high quality clinical trials,\" added Dr. Johannes.\nAbout Long Beach Medical Center"}, {"name": "<b>Long Beach</b> Offering After-School Program Starting in October", "url": "https://www.nbclosangeles.com/news/local/long-beach-offering-after-school-program-starting-in-october/2428154/", "datePublished": "2020-09-15T07:34:00.0000000Z", "organization": "NBC Los Angeles", "summary": "The Long Beach Parks, Recreation and Marine Administration announced Monday that it will offer an after-school program for children ages 5 to 10 beginning in October.\nRegistration will open Sept. 22 at longbeach.gov/park/ or in person from 8:30 a.m. to 4 p.m. at the El Dorado Nature Center.\nNature Detectives will follow a curriculum that corresponds to grade-level content standards for elementary-aged students.\nAll sessions will take place from 2:30 p.m. to 4 p.m. at the El Dorado Nature Center.\nAdditional information about Nature Detectives and other after school programs can be obtained by calling 562-570-3150 or visit longbeach.gov/park/."}, {"name": "Police rescue dog stranded in North <b>Long Beach</b> marsh", "url": "https://www.newsday.com/long-island/nassau/dog-rescue-north-long-beach-police-1.49323544", "datePublished": "2020-09-14T19:36:00.0000000Z", "organization": "Newsday", "summary": "Nassau County police rescued a dog that had become stranded in a marsh in North Long Beach on Monday morning, authorities said.\nPolice responded to call at around 8:30 a.m. about an adult male boxer in the wetland in the area of 600 Long Beach Rd.\nThe dog, police said, was stranded and unable to make its way back to shoreNassau Police Marine Bureau and Emergency Service officers responded to the scene and used their boat to traverse through the marsh, rescue the dog and transport it to a nearby dock.\nThe Town of Hempstead Animal Control took possession of the dog to have it medically evaluated and treated for its injuries.\nTown employees were able to contact the owner of the dog from an embedded electronic microchip."}]}