{"Title":{"0":"Armed robbery of ice cream truck leads to SWAT call and arrests of 3 teens, adult","1":"DUI motorist arrested after crashing into 7-Eleven Friday night, police say","2":"LASD investigating shooting death of man in Paramount","3":"Man barricades himself in home after making threats in Central Long Beach, police say","4":"2 DUIs reported this morning in Alamitos Beach; one ends in pursuit","5":"Police arrest pursuit suspect after standoff on 91 Freeway","6":"UPDATE: Man in critical condition after being shot with pellet gun in East Long Beach alley","7":"Man charged in fatal stabbing of Good Samaritan","8":"Long Beach man charged in last month’s fatal beating of 46-year-old","9":"Man hospitalized then arrested on suspicion of setting fire at West Long Beach business","10":"Armed robbery of ice cream truck leads to SWAT call and arrests of 3 teens, adult","11":"DUI motorist arrested after crashing into 7-Eleven Friday night, police say","12":"LASD investigating shooting death of man in Paramount","13":"Man barricades himself in home after making threats in Central Long Beach, police say","14":"2 DUIs reported this morning in Alamitos Beach; one ends in pursuit","15":"Police arrest pursuit suspect after standoff on 91 Freeway","16":"UPDATE: Man in critical condition after being shot with pellet gun in East Long Beach alley","17":"Man charged in fatal stabbing of Good Samaritan","18":"Long Beach man charged in last month’s fatal beating of 46-year-old","19":"Man hospitalized then arrested on suspicion of setting fire at West Long Beach business","20":"Armed robbery of ice cream truck leads to SWAT call and arrests of 3 teens, adult","21":"DUI motorist arrested after crashing into 7-Eleven Friday night, police say","22":"LASD investigating shooting death of man in Paramount","23":"Man barricades himself in home after making threats in Central Long Beach, police say","24":"2 DUIs reported this morning in Alamitos Beach; one ends in pursuit","25":"Police arrest pursuit suspect after standoff on 91 Freeway","26":"UPDATE: Man in critical condition after being shot with pellet gun in East Long Beach alley","27":"Man charged in fatal stabbing of Good Samaritan","28":"Long Beach man charged in last month’s fatal beating of 46-year-old","29":"Man hospitalized then arrested on suspicion of setting fire at West Long Beach business","30":"Armed robbery of ice cream truck leads to SWAT call and arrests of 3 teens, adult","31":"DUI motorist arrested after crashing into 7-Eleven Friday night, police say","32":"LASD investigating shooting death of man in Paramount","33":"Man barricades himself in home after making threats in Central Long Beach, police say","34":"2 DUIs reported this morning in Alamitos Beach; one ends in pursuit","35":"Police arrest pursuit suspect after standoff on 91 Freeway","36":"UPDATE: Man in critical condition after being shot with pellet gun in East Long Beach alley","37":"Man charged in fatal stabbing of Good Samaritan","38":"Long Beach man charged in last month’s fatal beating of 46-year-old","39":"Man hospitalized then arrested on suspicion of setting fire at West Long Beach business","40":"Armed robbery of ice cream truck leads to SWAT call and arrests of 3 teens, adult","41":"DUI motorist arrested after crashing into 7-Eleven Friday night, police say","42":"LASD investigating shooting death of man in Paramount","43":"Man barricades himself in home after making threats in Central Long Beach, police say","44":"2 DUIs reported this morning in Alamitos Beach; one ends in pursuit","45":"Police arrest pursuit suspect after standoff on 91 Freeway","46":"UPDATE: Man in critical condition after being shot with pellet gun in East Long Beach alley","47":"Man charged in fatal stabbing of Good Samaritan","48":"Long Beach man charged in last month’s fatal beating of 46-year-old","49":"Man hospitalized then arrested on suspicion of setting fire at West Long Beach business"},"Date Posted":{"0":1587996394000,"1":1587987576000,"2":1587973139000,"3":1587918980000,"4":1587729869000,"5":1587582911000,"6":1587557834000,"7":1587488316000,"8":1587402231000,"9":1587305477000,"10":1587996394000,"11":1587987576000,"12":1587973139000,"13":1587918980000,"14":1587729869000,"15":1587582911000,"16":1587557834000,"17":1587488316000,"18":1587402231000,"19":1587305477000,"20":1587996394000,"21":1587987576000,"22":1587973139000,"23":1587918980000,"24":1587729869000,"25":1587582911000,"26":1587557834000,"27":1587488316000,"28":1587402231000,"29":1587305477000,"30":1587996394000,"31":1587987576000,"32":1587973139000,"33":1587918980000,"34":1587729869000,"35":1587582911000,"36":1587557834000,"37":1587488316000,"38":1587402231000,"39":1587305477000,"40":1587996394000,"41":1587987576000,"42":1587973139000,"43":1587918980000,"44":1587729869000,"45":1587582911000,"46":1587557834000,"47":1587488316000,"48":1587402231000,"49":1587305477000},"Author":{"0":"Stephanie Rivera","1":"Stephanie Rivera","2":"City News Service","3":"Stephanie Rivera","4":"Valerie Osier","5":"City News Service","6":"Valerie Osier","7":"Valerie Osier","8":"Stephanie Rivera","9":"Stephanie Rivera","10":"Stephanie Rivera","11":"Stephanie Rivera","12":"City News Service","13":"Stephanie Rivera","14":"Valerie Osier","15":"City News Service","16":"Valerie Osier","17":"Valerie Osier","18":"Stephanie Rivera","19":"Stephanie Rivera","20":"Stephanie Rivera","21":"Stephanie Rivera","22":"City News Service","23":"Stephanie Rivera","24":"Valerie Osier","25":"City News Service","26":"Valerie Osier","27":"Valerie Osier","28":"Stephanie Rivera","29":"Stephanie Rivera","30":"Stephanie Rivera","31":"Stephanie Rivera","32":"City News Service","33":"Stephanie Rivera","34":"Valerie Osier","35":"City News Service","36":"Valerie Osier","37":"Valerie Osier","38":"Stephanie Rivera","39":"Stephanie Rivera","40":"Stephanie Rivera","41":"Stephanie Rivera","42":"City News Service","43":"Stephanie Rivera","44":"Valerie Osier","45":"City News Service","46":"Valerie Osier","47":"Valerie Osier","48":"Stephanie Rivera","49":"Stephanie Rivera"},"Description":{"0":"Police arrested three teens and a man in connection with the armed robbery of an ice cream truck that led to a SWAT call in Long Beach Sunday evening, authorities said. Officers responded to the incident at about 5 p.m. on April 26 in the 2400 block of Pasadena Avenue, near Burnett Street, according to Long Beach police spokeswoman Tonya Dean. When they arrived, the victim, a man, told officers he was robbed by four suspects. Police detained three underage teens at a separate location and were directed to a home on the same block of the initial incident where they believed the fourth suspect—a man armed with a handgun—had fled and barricaded himself inside. At that location, officers learned a child was inside the home with the suspect, police said. SWAT was activated but the suspect surrendered before they arrived, according to the LBPD. The child was later found sleeping unharmed and not believed to be in any danger. Authorities arrested Isaac Perez-Benitez, 20, of Long Beach on suspicion of robbery and assault with a deadly weapon. He was booked into Long Beach Jail where he was being held on $50,000 bail. In addition, two male Long Beach teens—a 15-year-old and 16-year-old—and a a male 16-year-old from Perris were taken to the Long Beach police juvenile booking facility where they were booked in connection with the robbery and released into the custody of their legal guardians with the promise to appear in court, Dean said. The loss was merchandise within the ice cream truck, police said. The investigation is still ongoing. Anyone with information on the incident is urged to contact LBPD Detective Eric Hubbard at 562-570-7464 or submit anonymous tips by calling 800-222-TIPS (8477). Stephanie Rivera","1":"Police say they arrested a Long Beach woman for allegedly driving under the influence and crashing into a 7-Eleven in the city’s Zaferia neighborhood Friday night. Officers responded to a report of a vehicle crashing into the convenience store near the corner of Redondo Avenue and 11th Street at about 8:45 p.m. on April 24, according to Long Beach police spokesman Ivan Garcia. A woman was arrested on suspicion of DUI after allegedly crashing into a 7-Eleven convenience store in Long Beach on Friday, April 24, 2020. Photo courtesy of a Long Beach Post reader. When officers arrived, they found a Chevrolet Camaro that had hit the businesses and the driver still at the scene. Police arrested 34-year-old Kara Williams on suspicion of DUI and subsequently booked her at Long Beach City Jail where she was held on $15,000 bail, Garcia said. No one was injured. The crash, which is still under investigation, is the latest suspected DUI incident after two men were arrested earlier Friday in connection with separate DUI crashes. Stephanie Rivera","2":"A man was shot to death Sunday evening in Paramount and the shooter remains at large, according to the sheriff’s department. The shooting in the 5800 block of San Vicenete Street‚ which is about a mile from Long Beach’s northernmost city limits, was reported at 5:19 p.m., Deputy Tracy Koerner said. The victim’s name was withheld pending family notification. There was no available suspect description, and a motive for the shooting was unknown. Anyone with information on this killing was asked to call the Sheriff’s Homicide Bureau at 323-890-5500. Tipsters can also call Crime Stoppers at 800-222-TIPS.","3":"A man was taken into custody Sunday afternoon after barricading himself inside a Central Long Beach residence, authorities said. Police responded initially to a criminal threats incident in the 1300 block of Dawson Avenue at about 2:15 p.m. on April 26, according to Long Beach police spokesman Ivan Garcia. When they arrived, police located the suspect on Cherry Avenue near Anaheim Street where he barricaded himself inside the home with his family members, Garcia said. SWAT was activated but the suspect surrendered and was taken into custody before they arrived. Police did not immediately provide any more details. The investigation is continuing. Stephanie Rivera","4":"Long Beach police arrested two men suspected of driving under the influence in separate incidents around 10 a.m. this morning. In the first incident, police started pursuing a driver in the area of Hellman Street and Walnut Avenue at about 10 a.m. after they suspected the driver was intoxicated, Sgt. Alvino Herrera said. “During the pursuit, the male adult driver stopped the vehicle and ran into a residence officers believed he was familiar with,” Herrera said. The passenger in the vehicle, a woman, stayed in the vehicle and was taken into custody, he said. Police arrested the man without incident after they formed a perimeter around the home in the 1700 block of Gardenia Avenue and called him out. A separate suspected DUI crash on Cherry Avenue and Fourth Street is unrelated, he said. In that incident, two vehicles crashed at about 10:05 a.m. When police got there, they found a car flipped over with the driver still inside. The officers helped the driver out of the car and called paramedics for his injuries, but he refused medical attention at the scene, Herrera said. He was arrested on suspicion of driving while intoxicated. Long Beach police officers search a man and eventually arrest him for a suspected DUI rollover crash at 4th Street and Cherry Avenue in Long Beach Friday, April 24, 2020. Photo by Thomas R. Cordova. Valerie Osier","5":"A man who allegedly committed an assault with a deadly weapon was arrested today after an approximately 20-minute chase from downtown Los Angeles to North Long Beach. Officers spotted the suspect about 3 p.m., and were led on a chase on the southbound Harbor (110) Freeway and the eastbound Artesia (91) Freeway, according to ABC7. The chase came to a halt when the suspect crashed into another vehicle near Cherry Avenue, but a standoff ensued for about an hour, shutting down both sides of the freeway in the vicinity. The shirtless suspect exited and re-entered the car several times, as officers negotiated with him and a K-9 stood-by on the other side of the freeway. Officers moved in on the suspect about 4:25 p.m. and took him into custody without further incident. Watch Live: Chrysler leads pursuit in downtown LA area. https:\/\/t.co\/2eyaZscOux https:\/\/t.co\/pbYeOJjiXZ — NBC Los Angeles (@NBCLA) April 22, 2020 ","6":"Long Beach police arrested a 25-year-old man after he got in an argument with another man and shot him with a pellet gun, officials said. Violent crimes detectives started investigating after a person alerted officers about a man down in the area of Granada Avenue and Stearns Street about 11:30 a.m. Tuesday, authorities said. Officers found a man with multiple puncture wounds in his upper body laying in an alley behind the 2200 block of Clark Avenue, Officer Ivan Garcia said. Officials later determined the puncture wounds were caused by a pellet gun and he was taken to a local hospital in critical condition. Police arrested Troy Hardy from Long Beach on suspicion of attempted murder. He is being held at the Long Beach City Jail on a $1 million bail. Editor’s note: This story has been updated with additional information from police. Valerie Osier","7":"A Signal Hill man pleaded not guilty, Tuesday, to charges that he fatally stabbed a Good Samaritan trying to detain him for violating a restraining order on April 3. Police said Edson Rufino, 19, was in violation of a restraining order his girlfriend’s mother had against him when he went to her home on 400 block of E. 21st Street. The victim, 31-year-old Leandro Maza, was visiting Long Beach with his father and fiance from Mar del Plata, Argentina, according to Argentinian newspaper Clarin. Police initially said Maza was the girlfriend’s mother’s roommate, but it appears he was an acquaintance. Prosecutors said when the mother called the police for violating the restraining order, Rufino threatened the girlfriend’s brother and another visitor to the home with a knife. He then fled to another home near the 2000 block of Linden Avenue, where Maza was staying. Maza then tried to keep Rufino detained until police got there, prosecutors said. “The defendant reportedly pushed his way out of the home and fatally stabbed Maza,” prosecutors said. Rufino has been charged with one felony count of murder, two felony counts of assault with a deadly weapon, as well as one misdemeanor count each of contempt of court and resisting arrest. If convicted as charged, he faces a possible maximum sentence of life in prison. His bail is set at $2 million and he is scheduled to return to court on May 12. Maza’s family is desperately trying to fundraise to get his body home to Argentina, but the effects of the pandemic are further complicating that effort, according to Clarin. Valerie Osier","8":"A Long Beach man was charged with voluntary manslaughter today in connection with the fatal beating of a 46-year-old man in North Long Beach last month, authorities said. Jahquan Hardesty, 25, remains released after posting an increased bond of $100,000, Long Beach officials stated. Hardesty is suspected of physically assaulting Isaac Smith of Anaheim on March 28, following an argument while attending a small gathering together, police said. Officers arrived at the residential housing complex in the 6800 block of Obispo Avenue at about 5:30 p.m. and performed live-saving measures for “a visible injury Smith sustained to his upper torso,” officials said. Paramedics arrived shortly after and transported the victim to a local hospital. Witnesses directed officers to Hardesty who was still at the scene and took him into custody without incident. He was booked into Long Beach City Jail for serious bodily injury, but later released when he posted $50,000 bail. Four days after Smith died from his injuries on March 30, detectives presented their case to the district attorney’s office. Anyone with information on the incident is urged to call LBPD’s violent crimes detectives Ethan Shear and Tim Redshaw at 562-570-7250. Stephanie Rivera","9":"A man was arrested today after authorities found him inside a West Long Beach business where he’s accused of breaking in and starting a fire, police said. Police first responded at about 5:50 a.m. to a report of an unwelcome subject inside a business that’s under construction in the 1900 block of West Pacific Coast Highway, just west of Santa Fe Avenue. When officers arrived, they saw smoke coming from within, according to Long Beach police spokesman Rudy Garcia. Long Beach firefighters soon arrived and forced their way into the business to extinguish the fire. Once the fire was put out, officers entered the business and took the suspect into custody without incident, police said. The man was briefly hospitalized after sustaining minor injuries from the fire, Garcia said. Once cleared from the hospital, he was booked at Long Beach Jail on suspicion of arson, obstruction, burglary and being a felon in possession of ammo, police said. His bail was set at $75,000. Authorities identified the man as 61-year-old Wilmington resident Richard Calderon. The Long Beach Fire Department’s arson unit is investigating the incident. Stephanie Rivera","10":"Police arrested three teens and a man in connection with the armed robbery of an ice cream truck that led to a SWAT call in Long Beach Sunday evening, authorities said. Officers responded to the incident at about 5 p.m. on April 26 in the 2400 block of Pasadena Avenue, near Burnett Street, according to Long Beach police spokeswoman Tonya Dean. When they arrived, the victim, a man, told officers he was robbed by four suspects. Police detained three underage teens at a separate location and were directed to a home on the same block of the initial incident where they believed the fourth suspect—a man armed with a handgun—had fled and barricaded himself inside. At that location, officers learned a child was inside the home with the suspect, police said. SWAT was activated but the suspect surrendered before they arrived, according to the LBPD. The child was later found sleeping unharmed and not believed to be in any danger. Authorities arrested Isaac Perez-Benitez, 20, of Long Beach on suspicion of robbery and assault with a deadly weapon. He was booked into Long Beach Jail where he was being held on $50,000 bail. In addition, two male Long Beach teens—a 15-year-old and 16-year-old—and a a male 16-year-old from Perris were taken to the Long Beach police juvenile booking facility where they were booked in connection with the robbery and released into the custody of their legal guardians with the promise to appear in court, Dean said. The loss was merchandise within the ice cream truck, police said. The investigation is still ongoing. Anyone with information on the incident is urged to contact LBPD Detective Eric Hubbard at 562-570-7464 or submit anonymous tips by calling 800-222-TIPS (8477). Stephanie Rivera","11":"Police say they arrested a Long Beach woman for allegedly driving under the influence and crashing into a 7-Eleven in the city’s Zaferia neighborhood Friday night. Officers responded to a report of a vehicle crashing into the convenience store near the corner of Redondo Avenue and 11th Street at about 8:45 p.m. on April 24, according to Long Beach police spokesman Ivan Garcia. A woman was arrested on suspicion of DUI after allegedly crashing into a 7-Eleven convenience store in Long Beach on Friday, April 24, 2020. Photo courtesy of a Long Beach Post reader. When officers arrived, they found a Chevrolet Camaro that had hit the businesses and the driver still at the scene. Police arrested 34-year-old Kara Williams on suspicion of DUI and subsequently booked her at Long Beach City Jail where she was held on $15,000 bail, Garcia said. No one was injured. The crash, which is still under investigation, is the latest suspected DUI incident after two men were arrested earlier Friday in connection with separate DUI crashes. Stephanie Rivera","12":"A man was shot to death Sunday evening in Paramount and the shooter remains at large, according to the sheriff’s department. The shooting in the 5800 block of San Vicenete Street‚ which is about a mile from Long Beach’s northernmost city limits, was reported at 5:19 p.m., Deputy Tracy Koerner said. The victim’s name was withheld pending family notification. There was no available suspect description, and a motive for the shooting was unknown. Anyone with information on this killing was asked to call the Sheriff’s Homicide Bureau at 323-890-5500. Tipsters can also call Crime Stoppers at 800-222-TIPS.","13":"A man was taken into custody Sunday afternoon after barricading himself inside a Central Long Beach residence, authorities said. Police responded initially to a criminal threats incident in the 1300 block of Dawson Avenue at about 2:15 p.m. on April 26, according to Long Beach police spokesman Ivan Garcia. When they arrived, police located the suspect on Cherry Avenue near Anaheim Street where he barricaded himself inside the home with his family members, Garcia said. SWAT was activated but the suspect surrendered and was taken into custody before they arrived. Police did not immediately provide any more details. The investigation is continuing. Stephanie Rivera","14":"Long Beach police arrested two men suspected of driving under the influence in separate incidents around 10 a.m. this morning. In the first incident, police started pursuing a driver in the area of Hellman Street and Walnut Avenue at about 10 a.m. after they suspected the driver was intoxicated, Sgt. Alvino Herrera said. “During the pursuit, the male adult driver stopped the vehicle and ran into a residence officers believed he was familiar with,” Herrera said. The passenger in the vehicle, a woman, stayed in the vehicle and was taken into custody, he said. Police arrested the man without incident after they formed a perimeter around the home in the 1700 block of Gardenia Avenue and called him out. A separate suspected DUI crash on Cherry Avenue and Fourth Street is unrelated, he said. In that incident, two vehicles crashed at about 10:05 a.m. When police got there, they found a car flipped over with the driver still inside. The officers helped the driver out of the car and called paramedics for his injuries, but he refused medical attention at the scene, Herrera said. He was arrested on suspicion of driving while intoxicated. Long Beach police officers search a man and eventually arrest him for a suspected DUI rollover crash at 4th Street and Cherry Avenue in Long Beach Friday, April 24, 2020. Photo by Thomas R. Cordova. Valerie Osier","15":"A man who allegedly committed an assault with a deadly weapon was arrested today after an approximately 20-minute chase from downtown Los Angeles to North Long Beach. Officers spotted the suspect about 3 p.m., and were led on a chase on the southbound Harbor (110) Freeway and the eastbound Artesia (91) Freeway, according to ABC7. The chase came to a halt when the suspect crashed into another vehicle near Cherry Avenue, but a standoff ensued for about an hour, shutting down both sides of the freeway in the vicinity. The shirtless suspect exited and re-entered the car several times, as officers negotiated with him and a K-9 stood-by on the other side of the freeway. Officers moved in on the suspect about 4:25 p.m. and took him into custody without further incident. Watch Live: Chrysler leads pursuit in downtown LA area. https:\/\/t.co\/2eyaZscOux https:\/\/t.co\/pbYeOJjiXZ — NBC Los Angeles (@NBCLA) April 22, 2020 ","16":"Long Beach police arrested a 25-year-old man after he got in an argument with another man and shot him with a pellet gun, officials said. Violent crimes detectives started investigating after a person alerted officers about a man down in the area of Granada Avenue and Stearns Street about 11:30 a.m. Tuesday, authorities said. Officers found a man with multiple puncture wounds in his upper body laying in an alley behind the 2200 block of Clark Avenue, Officer Ivan Garcia said. Officials later determined the puncture wounds were caused by a pellet gun and he was taken to a local hospital in critical condition. Police arrested Troy Hardy from Long Beach on suspicion of attempted murder. He is being held at the Long Beach City Jail on a $1 million bail. Editor’s note: This story has been updated with additional information from police. Valerie Osier","17":"A Signal Hill man pleaded not guilty, Tuesday, to charges that he fatally stabbed a Good Samaritan trying to detain him for violating a restraining order on April 3. Police said Edson Rufino, 19, was in violation of a restraining order his girlfriend’s mother had against him when he went to her home on 400 block of E. 21st Street. The victim, 31-year-old Leandro Maza, was visiting Long Beach with his father and fiance from Mar del Plata, Argentina, according to Argentinian newspaper Clarin. Police initially said Maza was the girlfriend’s mother’s roommate, but it appears he was an acquaintance. Prosecutors said when the mother called the police for violating the restraining order, Rufino threatened the girlfriend’s brother and another visitor to the home with a knife. He then fled to another home near the 2000 block of Linden Avenue, where Maza was staying. Maza then tried to keep Rufino detained until police got there, prosecutors said. “The defendant reportedly pushed his way out of the home and fatally stabbed Maza,” prosecutors said. Rufino has been charged with one felony count of murder, two felony counts of assault with a deadly weapon, as well as one misdemeanor count each of contempt of court and resisting arrest. If convicted as charged, he faces a possible maximum sentence of life in prison. His bail is set at $2 million and he is scheduled to return to court on May 12. Maza’s family is desperately trying to fundraise to get his body home to Argentina, but the effects of the pandemic are further complicating that effort, according to Clarin. Valerie Osier","18":"A Long Beach man was charged with voluntary manslaughter today in connection with the fatal beating of a 46-year-old man in North Long Beach last month, authorities said. Jahquan Hardesty, 25, remains released after posting an increased bond of $100,000, Long Beach officials stated. Hardesty is suspected of physically assaulting Isaac Smith of Anaheim on March 28, following an argument while attending a small gathering together, police said. Officers arrived at the residential housing complex in the 6800 block of Obispo Avenue at about 5:30 p.m. and performed live-saving measures for “a visible injury Smith sustained to his upper torso,” officials said. Paramedics arrived shortly after and transported the victim to a local hospital. Witnesses directed officers to Hardesty who was still at the scene and took him into custody without incident. He was booked into Long Beach City Jail for serious bodily injury, but later released when he posted $50,000 bail. Four days after Smith died from his injuries on March 30, detectives presented their case to the district attorney’s office. Anyone with information on the incident is urged to call LBPD’s violent crimes detectives Ethan Shear and Tim Redshaw at 562-570-7250. Stephanie Rivera","19":"A man was arrested today after authorities found him inside a West Long Beach business where he’s accused of breaking in and starting a fire, police said. Police first responded at about 5:50 a.m. to a report of an unwelcome subject inside a business that’s under construction in the 1900 block of West Pacific Coast Highway, just west of Santa Fe Avenue. When officers arrived, they saw smoke coming from within, according to Long Beach police spokesman Rudy Garcia. Long Beach firefighters soon arrived and forced their way into the business to extinguish the fire. Once the fire was put out, officers entered the business and took the suspect into custody without incident, police said. The man was briefly hospitalized after sustaining minor injuries from the fire, Garcia said. Once cleared from the hospital, he was booked at Long Beach Jail on suspicion of arson, obstruction, burglary and being a felon in possession of ammo, police said. His bail was set at $75,000. Authorities identified the man as 61-year-old Wilmington resident Richard Calderon. The Long Beach Fire Department’s arson unit is investigating the incident. Stephanie Rivera","20":"Police arrested three teens and a man in connection with the armed robbery of an ice cream truck that led to a SWAT call in Long Beach Sunday evening, authorities said. Officers responded to the incident at about 5 p.m. on April 26 in the 2400 block of Pasadena Avenue, near Burnett Street, according to Long Beach police spokeswoman Tonya Dean. When they arrived, the victim, a man, told officers he was robbed by four suspects. Police detained three underage teens at a separate location and were directed to a home on the same block of the initial incident where they believed the fourth suspect—a man armed with a handgun—had fled and barricaded himself inside. At that location, officers learned a child was inside the home with the suspect, police said. SWAT was activated but the suspect surrendered before they arrived, according to the LBPD. The child was later found sleeping unharmed and not believed to be in any danger. Authorities arrested Isaac Perez-Benitez, 20, of Long Beach on suspicion of robbery and assault with a deadly weapon. He was booked into Long Beach Jail where he was being held on $50,000 bail. In addition, two male Long Beach teens—a 15-year-old and 16-year-old—and a a male 16-year-old from Perris were taken to the Long Beach police juvenile booking facility where they were booked in connection with the robbery and released into the custody of their legal guardians with the promise to appear in court, Dean said. The loss was merchandise within the ice cream truck, police said. The investigation is still ongoing. Anyone with information on the incident is urged to contact LBPD Detective Eric Hubbard at 562-570-7464 or submit anonymous tips by calling 800-222-TIPS (8477). Stephanie Rivera","21":"Police say they arrested a Long Beach woman for allegedly driving under the influence and crashing into a 7-Eleven in the city’s Zaferia neighborhood Friday night. Officers responded to a report of a vehicle crashing into the convenience store near the corner of Redondo Avenue and 11th Street at about 8:45 p.m. on April 24, according to Long Beach police spokesman Ivan Garcia. A woman was arrested on suspicion of DUI after allegedly crashing into a 7-Eleven convenience store in Long Beach on Friday, April 24, 2020. Photo courtesy of a Long Beach Post reader. When officers arrived, they found a Chevrolet Camaro that had hit the businesses and the driver still at the scene. Police arrested 34-year-old Kara Williams on suspicion of DUI and subsequently booked her at Long Beach City Jail where she was held on $15,000 bail, Garcia said. No one was injured. The crash, which is still under investigation, is the latest suspected DUI incident after two men were arrested earlier Friday in connection with separate DUI crashes. Stephanie Rivera","22":"A man was shot to death Sunday evening in Paramount and the shooter remains at large, according to the sheriff’s department. The shooting in the 5800 block of San Vicenete Street‚ which is about a mile from Long Beach’s northernmost city limits, was reported at 5:19 p.m., Deputy Tracy Koerner said. The victim’s name was withheld pending family notification. There was no available suspect description, and a motive for the shooting was unknown. Anyone with information on this killing was asked to call the Sheriff’s Homicide Bureau at 323-890-5500. Tipsters can also call Crime Stoppers at 800-222-TIPS.","23":"A man was taken into custody Sunday afternoon after barricading himself inside a Central Long Beach residence, authorities said. Police responded initially to a criminal threats incident in the 1300 block of Dawson Avenue at about 2:15 p.m. on April 26, according to Long Beach police spokesman Ivan Garcia. When they arrived, police located the suspect on Cherry Avenue near Anaheim Street where he barricaded himself inside the home with his family members, Garcia said. SWAT was activated but the suspect surrendered and was taken into custody before they arrived. Police did not immediately provide any more details. The investigation is continuing. Stephanie Rivera","24":"Long Beach police arrested two men suspected of driving under the influence in separate incidents around 10 a.m. this morning. In the first incident, police started pursuing a driver in the area of Hellman Street and Walnut Avenue at about 10 a.m. after they suspected the driver was intoxicated, Sgt. Alvino Herrera said. “During the pursuit, the male adult driver stopped the vehicle and ran into a residence officers believed he was familiar with,” Herrera said. The passenger in the vehicle, a woman, stayed in the vehicle and was taken into custody, he said. Police arrested the man without incident after they formed a perimeter around the home in the 1700 block of Gardenia Avenue and called him out. A separate suspected DUI crash on Cherry Avenue and Fourth Street is unrelated, he said. In that incident, two vehicles crashed at about 10:05 a.m. When police got there, they found a car flipped over with the driver still inside. The officers helped the driver out of the car and called paramedics for his injuries, but he refused medical attention at the scene, Herrera said. He was arrested on suspicion of driving while intoxicated. Long Beach police officers search a man and eventually arrest him for a suspected DUI rollover crash at 4th Street and Cherry Avenue in Long Beach Friday, April 24, 2020. Photo by Thomas R. Cordova. Valerie Osier","25":"A man who allegedly committed an assault with a deadly weapon was arrested today after an approximately 20-minute chase from downtown Los Angeles to North Long Beach. Officers spotted the suspect about 3 p.m., and were led on a chase on the southbound Harbor (110) Freeway and the eastbound Artesia (91) Freeway, according to ABC7. The chase came to a halt when the suspect crashed into another vehicle near Cherry Avenue, but a standoff ensued for about an hour, shutting down both sides of the freeway in the vicinity. The shirtless suspect exited and re-entered the car several times, as officers negotiated with him and a K-9 stood-by on the other side of the freeway. Officers moved in on the suspect about 4:25 p.m. and took him into custody without further incident. Watch Live: Chrysler leads pursuit in downtown LA area. https:\/\/t.co\/2eyaZscOux https:\/\/t.co\/pbYeOJjiXZ — NBC Los Angeles (@NBCLA) April 22, 2020 ","26":"Long Beach police arrested a 25-year-old man after he got in an argument with another man and shot him with a pellet gun, officials said. Violent crimes detectives started investigating after a person alerted officers about a man down in the area of Granada Avenue and Stearns Street about 11:30 a.m. Tuesday, authorities said. Officers found a man with multiple puncture wounds in his upper body laying in an alley behind the 2200 block of Clark Avenue, Officer Ivan Garcia said. Officials later determined the puncture wounds were caused by a pellet gun and he was taken to a local hospital in critical condition. Police arrested Troy Hardy from Long Beach on suspicion of attempted murder. He is being held at the Long Beach City Jail on a $1 million bail. Editor’s note: This story has been updated with additional information from police. Valerie Osier","27":"A Signal Hill man pleaded not guilty, Tuesday, to charges that he fatally stabbed a Good Samaritan trying to detain him for violating a restraining order on April 3. Police said Edson Rufino, 19, was in violation of a restraining order his girlfriend’s mother had against him when he went to her home on 400 block of E. 21st Street. The victim, 31-year-old Leandro Maza, was visiting Long Beach with his father and fiance from Mar del Plata, Argentina, according to Argentinian newspaper Clarin. Police initially said Maza was the girlfriend’s mother’s roommate, but it appears he was an acquaintance. Prosecutors said when the mother called the police for violating the restraining order, Rufino threatened the girlfriend’s brother and another visitor to the home with a knife. He then fled to another home near the 2000 block of Linden Avenue, where Maza was staying. Maza then tried to keep Rufino detained until police got there, prosecutors said. “The defendant reportedly pushed his way out of the home and fatally stabbed Maza,” prosecutors said. Rufino has been charged with one felony count of murder, two felony counts of assault with a deadly weapon, as well as one misdemeanor count each of contempt of court and resisting arrest. If convicted as charged, he faces a possible maximum sentence of life in prison. His bail is set at $2 million and he is scheduled to return to court on May 12. Maza’s family is desperately trying to fundraise to get his body home to Argentina, but the effects of the pandemic are further complicating that effort, according to Clarin. Valerie Osier","28":"A Long Beach man was charged with voluntary manslaughter today in connection with the fatal beating of a 46-year-old man in North Long Beach last month, authorities said. Jahquan Hardesty, 25, remains released after posting an increased bond of $100,000, Long Beach officials stated. Hardesty is suspected of physically assaulting Isaac Smith of Anaheim on March 28, following an argument while attending a small gathering together, police said. Officers arrived at the residential housing complex in the 6800 block of Obispo Avenue at about 5:30 p.m. and performed live-saving measures for “a visible injury Smith sustained to his upper torso,” officials said. Paramedics arrived shortly after and transported the victim to a local hospital. Witnesses directed officers to Hardesty who was still at the scene and took him into custody without incident. He was booked into Long Beach City Jail for serious bodily injury, but later released when he posted $50,000 bail. Four days after Smith died from his injuries on March 30, detectives presented their case to the district attorney’s office. Anyone with information on the incident is urged to call LBPD’s violent crimes detectives Ethan Shear and Tim Redshaw at 562-570-7250. Stephanie Rivera","29":"A man was arrested today after authorities found him inside a West Long Beach business where he’s accused of breaking in and starting a fire, police said. Police first responded at about 5:50 a.m. to a report of an unwelcome subject inside a business that’s under construction in the 1900 block of West Pacific Coast Highway, just west of Santa Fe Avenue. When officers arrived, they saw smoke coming from within, according to Long Beach police spokesman Rudy Garcia. Long Beach firefighters soon arrived and forced their way into the business to extinguish the fire. Once the fire was put out, officers entered the business and took the suspect into custody without incident, police said. The man was briefly hospitalized after sustaining minor injuries from the fire, Garcia said. Once cleared from the hospital, he was booked at Long Beach Jail on suspicion of arson, obstruction, burglary and being a felon in possession of ammo, police said. His bail was set at $75,000. Authorities identified the man as 61-year-old Wilmington resident Richard Calderon. The Long Beach Fire Department’s arson unit is investigating the incident. Stephanie Rivera","30":"Police arrested three teens and a man in connection with the armed robbery of an ice cream truck that led to a SWAT call in Long Beach Sunday evening, authorities said. Officers responded to the incident at about 5 p.m. on April 26 in the 2400 block of Pasadena Avenue, near Burnett Street, according to Long Beach police spokeswoman Tonya Dean. When they arrived, the victim, a man, told officers he was robbed by four suspects. Police detained three underage teens at a separate location and were directed to a home on the same block of the initial incident where they believed the fourth suspect—a man armed with a handgun—had fled and barricaded himself inside. At that location, officers learned a child was inside the home with the suspect, police said. SWAT was activated but the suspect surrendered before they arrived, according to the LBPD. The child was later found sleeping unharmed and not believed to be in any danger. Authorities arrested Isaac Perez-Benitez, 20, of Long Beach on suspicion of robbery and assault with a deadly weapon. He was booked into Long Beach Jail where he was being held on $50,000 bail. In addition, two male Long Beach teens—a 15-year-old and 16-year-old—and a a male 16-year-old from Perris were taken to the Long Beach police juvenile booking facility where they were booked in connection with the robbery and released into the custody of their legal guardians with the promise to appear in court, Dean said. The loss was merchandise within the ice cream truck, police said. The investigation is still ongoing. Anyone with information on the incident is urged to contact LBPD Detective Eric Hubbard at 562-570-7464 or submit anonymous tips by calling 800-222-TIPS (8477). Stephanie Rivera","31":"Police say they arrested a Long Beach woman for allegedly driving under the influence and crashing into a 7-Eleven in the city’s Zaferia neighborhood Friday night. Officers responded to a report of a vehicle crashing into the convenience store near the corner of Redondo Avenue and 11th Street at about 8:45 p.m. on April 24, according to Long Beach police spokesman Ivan Garcia. A woman was arrested on suspicion of DUI after allegedly crashing into a 7-Eleven convenience store in Long Beach on Friday, April 24, 2020. Photo courtesy of a Long Beach Post reader. When officers arrived, they found a Chevrolet Camaro that had hit the businesses and the driver still at the scene. Police arrested 34-year-old Kara Williams on suspicion of DUI and subsequently booked her at Long Beach City Jail where she was held on $15,000 bail, Garcia said. No one was injured. The crash, which is still under investigation, is the latest suspected DUI incident after two men were arrested earlier Friday in connection with separate DUI crashes. Stephanie Rivera","32":"A man was shot to death Sunday evening in Paramount and the shooter remains at large, according to the sheriff’s department. The shooting in the 5800 block of San Vicenete Street‚ which is about a mile from Long Beach’s northernmost city limits, was reported at 5:19 p.m., Deputy Tracy Koerner said. The victim’s name was withheld pending family notification. There was no available suspect description, and a motive for the shooting was unknown. Anyone with information on this killing was asked to call the Sheriff’s Homicide Bureau at 323-890-5500. Tipsters can also call Crime Stoppers at 800-222-TIPS.","33":"A man was taken into custody Sunday afternoon after barricading himself inside a Central Long Beach residence, authorities said. Police responded initially to a criminal threats incident in the 1300 block of Dawson Avenue at about 2:15 p.m. on April 26, according to Long Beach police spokesman Ivan Garcia. When they arrived, police located the suspect on Cherry Avenue near Anaheim Street where he barricaded himself inside the home with his family members, Garcia said. SWAT was activated but the suspect surrendered and was taken into custody before they arrived. Police did not immediately provide any more details. The investigation is continuing. Stephanie Rivera","34":"Long Beach police arrested two men suspected of driving under the influence in separate incidents around 10 a.m. this morning. In the first incident, police started pursuing a driver in the area of Hellman Street and Walnut Avenue at about 10 a.m. after they suspected the driver was intoxicated, Sgt. Alvino Herrera said. “During the pursuit, the male adult driver stopped the vehicle and ran into a residence officers believed he was familiar with,” Herrera said. The passenger in the vehicle, a woman, stayed in the vehicle and was taken into custody, he said. Police arrested the man without incident after they formed a perimeter around the home in the 1700 block of Gardenia Avenue and called him out. A separate suspected DUI crash on Cherry Avenue and Fourth Street is unrelated, he said. In that incident, two vehicles crashed at about 10:05 a.m. When police got there, they found a car flipped over with the driver still inside. The officers helped the driver out of the car and called paramedics for his injuries, but he refused medical attention at the scene, Herrera said. He was arrested on suspicion of driving while intoxicated. Long Beach police officers search a man and eventually arrest him for a suspected DUI rollover crash at 4th Street and Cherry Avenue in Long Beach Friday, April 24, 2020. Photo by Thomas R. Cordova. Valerie Osier","35":"A man who allegedly committed an assault with a deadly weapon was arrested today after an approximately 20-minute chase from downtown Los Angeles to North Long Beach. Officers spotted the suspect about 3 p.m., and were led on a chase on the southbound Harbor (110) Freeway and the eastbound Artesia (91) Freeway, according to ABC7. The chase came to a halt when the suspect crashed into another vehicle near Cherry Avenue, but a standoff ensued for about an hour, shutting down both sides of the freeway in the vicinity. The shirtless suspect exited and re-entered the car several times, as officers negotiated with him and a K-9 stood-by on the other side of the freeway. Officers moved in on the suspect about 4:25 p.m. and took him into custody without further incident. Watch Live: Chrysler leads pursuit in downtown LA area. https:\/\/t.co\/2eyaZscOux https:\/\/t.co\/pbYeOJjiXZ — NBC Los Angeles (@NBCLA) April 22, 2020 ","36":"Long Beach police arrested a 25-year-old man after he got in an argument with another man and shot him with a pellet gun, officials said. Violent crimes detectives started investigating after a person alerted officers about a man down in the area of Granada Avenue and Stearns Street about 11:30 a.m. Tuesday, authorities said. Officers found a man with multiple puncture wounds in his upper body laying in an alley behind the 2200 block of Clark Avenue, Officer Ivan Garcia said. Officials later determined the puncture wounds were caused by a pellet gun and he was taken to a local hospital in critical condition. Police arrested Troy Hardy from Long Beach on suspicion of attempted murder. He is being held at the Long Beach City Jail on a $1 million bail. Editor’s note: This story has been updated with additional information from police. Valerie Osier","37":"A Signal Hill man pleaded not guilty, Tuesday, to charges that he fatally stabbed a Good Samaritan trying to detain him for violating a restraining order on April 3. Police said Edson Rufino, 19, was in violation of a restraining order his girlfriend’s mother had against him when he went to her home on 400 block of E. 21st Street. The victim, 31-year-old Leandro Maza, was visiting Long Beach with his father and fiance from Mar del Plata, Argentina, according to Argentinian newspaper Clarin. Police initially said Maza was the girlfriend’s mother’s roommate, but it appears he was an acquaintance. Prosecutors said when the mother called the police for violating the restraining order, Rufino threatened the girlfriend’s brother and another visitor to the home with a knife. He then fled to another home near the 2000 block of Linden Avenue, where Maza was staying. Maza then tried to keep Rufino detained until police got there, prosecutors said. “The defendant reportedly pushed his way out of the home and fatally stabbed Maza,” prosecutors said. Rufino has been charged with one felony count of murder, two felony counts of assault with a deadly weapon, as well as one misdemeanor count each of contempt of court and resisting arrest. If convicted as charged, he faces a possible maximum sentence of life in prison. His bail is set at $2 million and he is scheduled to return to court on May 12. Maza’s family is desperately trying to fundraise to get his body home to Argentina, but the effects of the pandemic are further complicating that effort, according to Clarin. Valerie Osier","38":"A Long Beach man was charged with voluntary manslaughter today in connection with the fatal beating of a 46-year-old man in North Long Beach last month, authorities said. Jahquan Hardesty, 25, remains released after posting an increased bond of $100,000, Long Beach officials stated. Hardesty is suspected of physically assaulting Isaac Smith of Anaheim on March 28, following an argument while attending a small gathering together, police said. Officers arrived at the residential housing complex in the 6800 block of Obispo Avenue at about 5:30 p.m. and performed live-saving measures for “a visible injury Smith sustained to his upper torso,” officials said. Paramedics arrived shortly after and transported the victim to a local hospital. Witnesses directed officers to Hardesty who was still at the scene and took him into custody without incident. He was booked into Long Beach City Jail for serious bodily injury, but later released when he posted $50,000 bail. Four days after Smith died from his injuries on March 30, detectives presented their case to the district attorney’s office. Anyone with information on the incident is urged to call LBPD’s violent crimes detectives Ethan Shear and Tim Redshaw at 562-570-7250. Stephanie Rivera","39":"A man was arrested today after authorities found him inside a West Long Beach business where he’s accused of breaking in and starting a fire, police said. Police first responded at about 5:50 a.m. to a report of an unwelcome subject inside a business that’s under construction in the 1900 block of West Pacific Coast Highway, just west of Santa Fe Avenue. When officers arrived, they saw smoke coming from within, according to Long Beach police spokesman Rudy Garcia. Long Beach firefighters soon arrived and forced their way into the business to extinguish the fire. Once the fire was put out, officers entered the business and took the suspect into custody without incident, police said. The man was briefly hospitalized after sustaining minor injuries from the fire, Garcia said. Once cleared from the hospital, he was booked at Long Beach Jail on suspicion of arson, obstruction, burglary and being a felon in possession of ammo, police said. His bail was set at $75,000. Authorities identified the man as 61-year-old Wilmington resident Richard Calderon. The Long Beach Fire Department’s arson unit is investigating the incident. Stephanie Rivera","40":"Police arrested three teens and a man in connection with the armed robbery of an ice cream truck that led to a SWAT call in Long Beach Sunday evening, authorities said. Officers responded to the incident at about 5 p.m. on April 26 in the 2400 block of Pasadena Avenue, near Burnett Street, according to Long Beach police spokeswoman Tonya Dean. When they arrived, the victim, a man, told officers he was robbed by four suspects. Police detained three underage teens at a separate location and were directed to a home on the same block of the initial incident where they believed the fourth suspect—a man armed with a handgun—had fled and barricaded himself inside. At that location, officers learned a child was inside the home with the suspect, police said. SWAT was activated but the suspect surrendered before they arrived, according to the LBPD. The child was later found sleeping unharmed and not believed to be in any danger. Authorities arrested Isaac Perez-Benitez, 20, of Long Beach on suspicion of robbery and assault with a deadly weapon. He was booked into Long Beach Jail where he was being held on $50,000 bail. In addition, two male Long Beach teens—a 15-year-old and 16-year-old—and a a male 16-year-old from Perris were taken to the Long Beach police juvenile booking facility where they were booked in connection with the robbery and released into the custody of their legal guardians with the promise to appear in court, Dean said. The loss was merchandise within the ice cream truck, police said. The investigation is still ongoing. Anyone with information on the incident is urged to contact LBPD Detective Eric Hubbard at 562-570-7464 or submit anonymous tips by calling 800-222-TIPS (8477). Stephanie Rivera","41":"Police say they arrested a Long Beach woman for allegedly driving under the influence and crashing into a 7-Eleven in the city’s Zaferia neighborhood Friday night. Officers responded to a report of a vehicle crashing into the convenience store near the corner of Redondo Avenue and 11th Street at about 8:45 p.m. on April 24, according to Long Beach police spokesman Ivan Garcia. A woman was arrested on suspicion of DUI after allegedly crashing into a 7-Eleven convenience store in Long Beach on Friday, April 24, 2020. Photo courtesy of a Long Beach Post reader. When officers arrived, they found a Chevrolet Camaro that had hit the businesses and the driver still at the scene. Police arrested 34-year-old Kara Williams on suspicion of DUI and subsequently booked her at Long Beach City Jail where she was held on $15,000 bail, Garcia said. No one was injured. The crash, which is still under investigation, is the latest suspected DUI incident after two men were arrested earlier Friday in connection with separate DUI crashes. Stephanie Rivera","42":"A man was shot to death Sunday evening in Paramount and the shooter remains at large, according to the sheriff’s department. The shooting in the 5800 block of San Vicenete Street‚ which is about a mile from Long Beach’s northernmost city limits, was reported at 5:19 p.m., Deputy Tracy Koerner said. The victim’s name was withheld pending family notification. There was no available suspect description, and a motive for the shooting was unknown. Anyone with information on this killing was asked to call the Sheriff’s Homicide Bureau at 323-890-5500. Tipsters can also call Crime Stoppers at 800-222-TIPS.","43":"A man was taken into custody Sunday afternoon after barricading himself inside a Central Long Beach residence, authorities said. Police responded initially to a criminal threats incident in the 1300 block of Dawson Avenue at about 2:15 p.m. on April 26, according to Long Beach police spokesman Ivan Garcia. When they arrived, police located the suspect on Cherry Avenue near Anaheim Street where he barricaded himself inside the home with his family members, Garcia said. SWAT was activated but the suspect surrendered and was taken into custody before they arrived. Police did not immediately provide any more details. The investigation is continuing. Stephanie Rivera","44":"Long Beach police arrested two men suspected of driving under the influence in separate incidents around 10 a.m. this morning. In the first incident, police started pursuing a driver in the area of Hellman Street and Walnut Avenue at about 10 a.m. after they suspected the driver was intoxicated, Sgt. Alvino Herrera said. “During the pursuit, the male adult driver stopped the vehicle and ran into a residence officers believed he was familiar with,” Herrera said. The passenger in the vehicle, a woman, stayed in the vehicle and was taken into custody, he said. Police arrested the man without incident after they formed a perimeter around the home in the 1700 block of Gardenia Avenue and called him out. A separate suspected DUI crash on Cherry Avenue and Fourth Street is unrelated, he said. In that incident, two vehicles crashed at about 10:05 a.m. When police got there, they found a car flipped over with the driver still inside. The officers helped the driver out of the car and called paramedics for his injuries, but he refused medical attention at the scene, Herrera said. He was arrested on suspicion of driving while intoxicated. Long Beach police officers search a man and eventually arrest him for a suspected DUI rollover crash at 4th Street and Cherry Avenue in Long Beach Friday, April 24, 2020. Photo by Thomas R. Cordova. Valerie Osier","45":"A man who allegedly committed an assault with a deadly weapon was arrested today after an approximately 20-minute chase from downtown Los Angeles to North Long Beach. Officers spotted the suspect about 3 p.m., and were led on a chase on the southbound Harbor (110) Freeway and the eastbound Artesia (91) Freeway, according to ABC7. The chase came to a halt when the suspect crashed into another vehicle near Cherry Avenue, but a standoff ensued for about an hour, shutting down both sides of the freeway in the vicinity. The shirtless suspect exited and re-entered the car several times, as officers negotiated with him and a K-9 stood-by on the other side of the freeway. Officers moved in on the suspect about 4:25 p.m. and took him into custody without further incident. Watch Live: Chrysler leads pursuit in downtown LA area. https:\/\/t.co\/2eyaZscOux https:\/\/t.co\/pbYeOJjiXZ — NBC Los Angeles (@NBCLA) April 22, 2020 ","46":"Long Beach police arrested a 25-year-old man after he got in an argument with another man and shot him with a pellet gun, officials said. Violent crimes detectives started investigating after a person alerted officers about a man down in the area of Granada Avenue and Stearns Street about 11:30 a.m. Tuesday, authorities said. Officers found a man with multiple puncture wounds in his upper body laying in an alley behind the 2200 block of Clark Avenue, Officer Ivan Garcia said. Officials later determined the puncture wounds were caused by a pellet gun and he was taken to a local hospital in critical condition. Police arrested Troy Hardy from Long Beach on suspicion of attempted murder. He is being held at the Long Beach City Jail on a $1 million bail. Editor’s note: This story has been updated with additional information from police. Valerie Osier","47":"A Signal Hill man pleaded not guilty, Tuesday, to charges that he fatally stabbed a Good Samaritan trying to detain him for violating a restraining order on April 3. Police said Edson Rufino, 19, was in violation of a restraining order his girlfriend’s mother had against him when he went to her home on 400 block of E. 21st Street. The victim, 31-year-old Leandro Maza, was visiting Long Beach with his father and fiance from Mar del Plata, Argentina, according to Argentinian newspaper Clarin. Police initially said Maza was the girlfriend’s mother’s roommate, but it appears he was an acquaintance. Prosecutors said when the mother called the police for violating the restraining order, Rufino threatened the girlfriend’s brother and another visitor to the home with a knife. He then fled to another home near the 2000 block of Linden Avenue, where Maza was staying. Maza then tried to keep Rufino detained until police got there, prosecutors said. “The defendant reportedly pushed his way out of the home and fatally stabbed Maza,” prosecutors said. Rufino has been charged with one felony count of murder, two felony counts of assault with a deadly weapon, as well as one misdemeanor count each of contempt of court and resisting arrest. If convicted as charged, he faces a possible maximum sentence of life in prison. His bail is set at $2 million and he is scheduled to return to court on May 12. Maza’s family is desperately trying to fundraise to get his body home to Argentina, but the effects of the pandemic are further complicating that effort, according to Clarin. Valerie Osier","48":"A Long Beach man was charged with voluntary manslaughter today in connection with the fatal beating of a 46-year-old man in North Long Beach last month, authorities said. Jahquan Hardesty, 25, remains released after posting an increased bond of $100,000, Long Beach officials stated. Hardesty is suspected of physically assaulting Isaac Smith of Anaheim on March 28, following an argument while attending a small gathering together, police said. Officers arrived at the residential housing complex in the 6800 block of Obispo Avenue at about 5:30 p.m. and performed live-saving measures for “a visible injury Smith sustained to his upper torso,” officials said. Paramedics arrived shortly after and transported the victim to a local hospital. Witnesses directed officers to Hardesty who was still at the scene and took him into custody without incident. He was booked into Long Beach City Jail for serious bodily injury, but later released when he posted $50,000 bail. Four days after Smith died from his injuries on March 30, detectives presented their case to the district attorney’s office. Anyone with information on the incident is urged to call LBPD’s violent crimes detectives Ethan Shear and Tim Redshaw at 562-570-7250. Stephanie Rivera","49":"A man was arrested today after authorities found him inside a West Long Beach business where he’s accused of breaking in and starting a fire, police said. Police first responded at about 5:50 a.m. to a report of an unwelcome subject inside a business that’s under construction in the 1900 block of West Pacific Coast Highway, just west of Santa Fe Avenue. When officers arrived, they saw smoke coming from within, according to Long Beach police spokesman Rudy Garcia. Long Beach firefighters soon arrived and forced their way into the business to extinguish the fire. Once the fire was put out, officers entered the business and took the suspect into custody without incident, police said. The man was briefly hospitalized after sustaining minor injuries from the fire, Garcia said. Once cleared from the hospital, he was booked at Long Beach Jail on suspicion of arson, obstruction, burglary and being a felon in possession of ammo, police said. His bail was set at $75,000. Authorities identified the man as 61-year-old Wilmington resident Richard Calderon. The Long Beach Fire Department’s arson unit is investigating the incident. Stephanie Rivera"},"Tag":{"0":"armed robbery","1":"DUI crash","2":"Homicide","3":"barricaded suspect","4":"DUI","5":"police pursuit","6":"attempted murder arrest","7":"Stabbing","8":"voluntary manslaughter","9":"burglary arrest","10":"armed robbery","11":"DUI crash","12":"Homicide","13":"barricaded suspect","14":"DUI","15":"police pursuit","16":"attempted murder arrest","17":"Stabbing","18":"voluntary manslaughter","19":"burglary arrest","20":"armed robbery","21":"DUI crash","22":"Homicide","23":"barricaded suspect","24":"DUI","25":"police pursuit","26":"attempted murder arrest","27":"Stabbing","28":"voluntary manslaughter","29":"burglary arrest","30":"armed robbery","31":"DUI crash","32":"Homicide","33":"barricaded suspect","34":"DUI","35":"police pursuit","36":"attempted murder arrest","37":"Stabbing","38":"voluntary manslaughter","39":"burglary arrest","40":"armed robbery","41":"DUI crash","42":"Homicide","43":"barricaded suspect","44":"DUI","45":"police pursuit","46":"attempted murder arrest","47":"Stabbing","48":"voluntary manslaughter","49":"burglary arrest"},"Link":{"0":"https:\/\/lbpost.com\/news\/armed-robbery-of-ice-cream-truck-leads-to-swat-call-and-arrests-of-3-teens-adult","1":"https:\/\/lbpost.com\/news\/crime\/dui-motorist-arrested-after-crashing-into-7-eleven-friday-night-police-say","2":"https:\/\/lbpost.com\/news\/crime\/shooting-homicide-paramount-san-vicente-street","3":"https:\/\/lbpost.com\/news\/crime\/barricade-swat-cherry-anaheim-police","4":"https:\/\/lbpost.com\/news\/crime\/2-duis-reported-this-morning-in-alamitos-beach-one-ends-in-pursuit","5":"https:\/\/lbpost.com\/news\/crime\/pursuit-91-freeway-closed-traffic-crash","6":"https:\/\/lbpost.com\/news\/crime\/man-in-critical-condition-after-being-found-with-puncture-wounds-in-east-long-beach-alley","7":"https:\/\/lbpost.com\/news\/crime\/man-charged-in-fatal-stabbing-of-good-samaritan","8":"https:\/\/lbpost.com\/news\/voluntary-manslaughter-charges-fatal-beating-obispo","9":"https:\/\/lbpost.com\/news\/crime\/fires-business-break-in-long-beach-arrest-pch","10":"https:\/\/lbpost.com\/news\/armed-robbery-of-ice-cream-truck-leads-to-swat-call-and-arrests-of-3-teens-adult","11":"https:\/\/lbpost.com\/news\/crime\/dui-motorist-arrested-after-crashing-into-7-eleven-friday-night-police-say","12":"https:\/\/lbpost.com\/news\/crime\/shooting-homicide-paramount-san-vicente-street","13":"https:\/\/lbpost.com\/news\/crime\/barricade-swat-cherry-anaheim-police","14":"https:\/\/lbpost.com\/news\/crime\/2-duis-reported-this-morning-in-alamitos-beach-one-ends-in-pursuit","15":"https:\/\/lbpost.com\/news\/crime\/pursuit-91-freeway-closed-traffic-crash","16":"https:\/\/lbpost.com\/news\/crime\/man-in-critical-condition-after-being-found-with-puncture-wounds-in-east-long-beach-alley","17":"https:\/\/lbpost.com\/news\/crime\/man-charged-in-fatal-stabbing-of-good-samaritan","18":"https:\/\/lbpost.com\/news\/voluntary-manslaughter-charges-fatal-beating-obispo","19":"https:\/\/lbpost.com\/news\/crime\/fires-business-break-in-long-beach-arrest-pch","20":"https:\/\/lbpost.com\/news\/armed-robbery-of-ice-cream-truck-leads-to-swat-call-and-arrests-of-3-teens-adult","21":"https:\/\/lbpost.com\/news\/crime\/dui-motorist-arrested-after-crashing-into-7-eleven-friday-night-police-say","22":"https:\/\/lbpost.com\/news\/crime\/shooting-homicide-paramount-san-vicente-street","23":"https:\/\/lbpost.com\/news\/crime\/barricade-swat-cherry-anaheim-police","24":"https:\/\/lbpost.com\/news\/crime\/2-duis-reported-this-morning-in-alamitos-beach-one-ends-in-pursuit","25":"https:\/\/lbpost.com\/news\/crime\/pursuit-91-freeway-closed-traffic-crash","26":"https:\/\/lbpost.com\/news\/crime\/man-in-critical-condition-after-being-found-with-puncture-wounds-in-east-long-beach-alley","27":"https:\/\/lbpost.com\/news\/crime\/man-charged-in-fatal-stabbing-of-good-samaritan","28":"https:\/\/lbpost.com\/news\/voluntary-manslaughter-charges-fatal-beating-obispo","29":"https:\/\/lbpost.com\/news\/crime\/fires-business-break-in-long-beach-arrest-pch","30":"https:\/\/lbpost.com\/news\/armed-robbery-of-ice-cream-truck-leads-to-swat-call-and-arrests-of-3-teens-adult","31":"https:\/\/lbpost.com\/news\/crime\/dui-motorist-arrested-after-crashing-into-7-eleven-friday-night-police-say","32":"https:\/\/lbpost.com\/news\/crime\/shooting-homicide-paramount-san-vicente-street","33":"https:\/\/lbpost.com\/news\/crime\/barricade-swat-cherry-anaheim-police","34":"https:\/\/lbpost.com\/news\/crime\/2-duis-reported-this-morning-in-alamitos-beach-one-ends-in-pursuit","35":"https:\/\/lbpost.com\/news\/crime\/pursuit-91-freeway-closed-traffic-crash","36":"https:\/\/lbpost.com\/news\/crime\/man-in-critical-condition-after-being-found-with-puncture-wounds-in-east-long-beach-alley","37":"https:\/\/lbpost.com\/news\/crime\/man-charged-in-fatal-stabbing-of-good-samaritan","38":"https:\/\/lbpost.com\/news\/voluntary-manslaughter-charges-fatal-beating-obispo","39":"https:\/\/lbpost.com\/news\/crime\/fires-business-break-in-long-beach-arrest-pch","40":"https:\/\/lbpost.com\/news\/armed-robbery-of-ice-cream-truck-leads-to-swat-call-and-arrests-of-3-teens-adult","41":"https:\/\/lbpost.com\/news\/crime\/dui-motorist-arrested-after-crashing-into-7-eleven-friday-night-police-say","42":"https:\/\/lbpost.com\/news\/crime\/shooting-homicide-paramount-san-vicente-street","43":"https:\/\/lbpost.com\/news\/crime\/barricade-swat-cherry-anaheim-police","44":"https:\/\/lbpost.com\/news\/crime\/2-duis-reported-this-morning-in-alamitos-beach-one-ends-in-pursuit","45":"https:\/\/lbpost.com\/news\/crime\/pursuit-91-freeway-closed-traffic-crash","46":"https:\/\/lbpost.com\/news\/crime\/man-in-critical-condition-after-being-found-with-puncture-wounds-in-east-long-beach-alley","47":"https:\/\/lbpost.com\/news\/crime\/man-charged-in-fatal-stabbing-of-good-samaritan","48":"https:\/\/lbpost.com\/news\/voluntary-manslaughter-charges-fatal-beating-obispo","49":"https:\/\/lbpost.com\/news\/crime\/fires-business-break-in-long-beach-arrest-pch"}}